<!-- dflook/terraform-github-actions {"workspace":"more-linting","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"af31c904ca9675db988da03508a39e25308b43b0c070a3a3c5eb440d69eb015f","plan_job_ref":"Job Test actions using target and replace #468 at https://github.com/dflook/terraform-github-actions/actions/runs/14018638206","plan_hash":"f371af570367788f670fd859f17db0117c4c21e3d6967a0e1c3383a0d5b5a1c2","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __more-linting__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "UOPM3mNpTr" -> (known after apply)
!~  foreach = "ZlvXSGJsbR" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #468](https://github.com/dflook/terraform-github-actions/actions/runs/14018638206)